package org.javaacademy.module1.lesson4.homework4.office;

//Босс обладает именем. Умеет подгонять менеджера - "{Имя менеджера}" быстрее!
//Менеджер обладает именем. Умеет кричать - "я ничего не успеваю, помогите!".
//Секретарь умеет просить менеджера и босса успокоится, а охранника подождать:
//"{Имя босса} не волнуйтесь, {имя менеджера} все успеет. {имя охранника} - подождите!"
//Охранник обладает именем. Просит выдать ему аванс.
//В офисе есть метод рабочий день:
//--Босс начинает подгонять менеджера
//--Менеджер кричит
//--Охранник просит аванс
//--Секретарша всех успокаивает, и просит подождать

public class Office {
    String bossName;
    String manager;
    String secretary;
    String security;
}
